_site/org/colloquium/ocene_2018.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="sr" xml:lang="sr">
<head>
<!-- 2018-06-18 Mon 14:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Napredne tehnike programiranja - ocene</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Novak Boškov" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Napredne tehnike programiranja - ocene</h1>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">br.</th>
<th scope="col" class="org-left">br. indeksa</th>
<th scope="col" class="org-left">ime i prezime</th>
<th scope="col" class="org-right">python</th>
<th scope="col" class="org-right">clojure</th>
<th scope="col" class="org-right">smalltalk</th>
<th scope="col" class="org-right">haskell</th>
<th scope="col" class="org-right">ukupno kol</th>
<th scope="col" class="org-left">projekat</th>
<th scope="col" class="org-left">test za 6</th>
<th scope="col" class="org-right">ukupno</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">SW1/2014</td>
<td class="org-left">Žarko      Drageljević</td>
<td class="org-right">100</td>
<td class="org-right">92.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">98.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">98.</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">SW4/2014</td>
<td class="org-left">Vladimir   Inđić</td>
<td class="org-right">90</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">97.500</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">97.5</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">SW10/2014</td>
<td class="org-left">Milana     Bečejac</td>
<td class="org-right">80</td>
<td class="org-right">92.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">93.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">93.</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">SW56/2014</td>
<td class="org-left">Milan      Desančić</td>
<td class="org-right">100</td>
<td class="org-right">69.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">92.250</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">92.25</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">SW6/2014</td>
<td class="org-left">Helena     Zečević</td>
<td class="org-right">100</td>
<td class="org-right">92.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">98.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">98.</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">SW7/2014</td>
<td class="org-left">Luka       Maletin</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">100.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">100.</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">SW25/2014</td>
<td class="org-left">Aleksandar Nikolić</td>
<td class="org-right">90</td>
<td class="org-right">92.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">95.500</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">95.5</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">SW28/2014</td>
<td class="org-left">Nemanja    Brzak</td>
<td class="org-right">80</td>
<td class="org-right">46.00</td>
<td class="org-right">100</td>
<td class="org-right">80</td>
<td class="org-right">76.500</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">76.5</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">SW22/2014</td>
<td class="org-left">Marija     Kovačević</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">0.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0.</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">SW42/2014</td>
<td class="org-left">Jelena     Ilić</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">90</td>
<td class="org-right">97.500</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">97.5</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-left">SW45/2014</td>
<td class="org-left">Drago      Stevanović</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">100.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">100.</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-left">SW54/2014</td>
<td class="org-left">David      Vuletaš</td>
<td class="org-right">100</td>
<td class="org-right">80.50</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">95.125</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">95.125</td>
</tr>

<tr>
<td class="org-right">13</td>
<td class="org-left">SW31/2014</td>
<td class="org-left">Petar      Radošević</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">100.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">100.</td>
</tr>

<tr>
<td class="org-right">14</td>
<td class="org-left">SW34/2014</td>
<td class="org-left">Luka       Mihajlović</td>
<td class="org-right">100</td>
<td class="org-right">92.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">98.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">98.</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-left">SW37/2014</td>
<td class="org-left">Vojin      Pešalj</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">100.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">100.</td>
</tr>

<tr>
<td class="org-right">16</td>
<td class="org-left">SW58/2014</td>
<td class="org-left">Michael    Milinković</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">0.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0.</td>
</tr>

<tr>
<td class="org-right">17</td>
<td class="org-left">SW13/2014</td>
<td class="org-left">Katarina   Čukurov</td>
<td class="org-right">100</td>
<td class="org-right">69.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">92.250</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">92.25</td>
</tr>

<tr>
<td class="org-right">18</td>
<td class="org-left">SW94/2016</td>
<td class="org-left">Nikola     Garabandić</td>
<td class="org-right">100</td>
<td class="org-right">69.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">92.250</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">92.25</td>
</tr>

<tr>
<td class="org-right">19</td>
<td class="org-left">SW12/2014</td>
<td class="org-left">Ivana      Zeljković</td>
<td class="org-right">100</td>
<td class="org-right">92.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">98.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">98.</td>
</tr>

<tr>
<td class="org-right">20</td>
<td class="org-left">SW33/2014</td>
<td class="org-left">Dejan      Zarić</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">100.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">100.</td>
</tr>

<tr>
<td class="org-right">21</td>
<td class="org-left">SW32/2014</td>
<td class="org-left">Nikola     Lošić</td>
<td class="org-right">90</td>
<td class="org-right">92.00</td>
<td class="org-right">100</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">70.500</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">70.5</td>
</tr>

<tr>
<td class="org-right">22</td>
<td class="org-left">SW11/2014</td>
<td class="org-left">Dragan     Vujanović</td>
<td class="org-right">100</td>
<td class="org-right">92.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">98.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">98.</td>
</tr>

<tr>
<td class="org-right">23</td>
<td class="org-left">SW24/2014</td>
<td class="org-left">Acko       Spasić</td>
<td class="org-right">100</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">75.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">75.</td>
</tr>

<tr>
<td class="org-right">24</td>
<td class="org-left">SW47/2014</td>
<td class="org-left">Ana        Rudić</td>
<td class="org-right">90</td>
<td class="org-right">69.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">89.750</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">89.75</td>
</tr>

<tr>
<td class="org-right">25</td>
<td class="org-left">SW48/2014</td>
<td class="org-left">Novak      Marin</td>
<td class="org-right">80</td>
<td class="org-right">46.00</td>
<td class="org-right">100</td>
<td class="org-right">90</td>
<td class="org-right">79.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">79.</td>
</tr>

<tr>
<td class="org-right">26</td>
<td class="org-left">SW50/2014</td>
<td class="org-left">Vanja      Zorić</td>
<td class="org-right">80</td>
<td class="org-right">69.00</td>
<td class="org-right">100</td>
<td class="org-right">80</td>
<td class="org-right">82.250</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">82.25</td>
</tr>

<tr>
<td class="org-right">27</td>
<td class="org-left">SW60/2014</td>
<td class="org-left">Dušan      Dudarin</td>
<td class="org-right">30</td>
<td class="org-right">46.00</td>
<td class="org-right">100</td>
<td class="org-right">70</td>
<td class="org-right">61.500</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">61.5</td>
</tr>

<tr>
<td class="org-right">28</td>
<td class="org-left">SW17/2014</td>
<td class="org-left">Sandra     Rajanović</td>
<td class="org-right">80</td>
<td class="org-right">69.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">87.250</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">87.25</td>
</tr>

<tr>
<td class="org-right">29</td>
<td class="org-left">SW27/2014</td>
<td class="org-left">Nikolina   Radičić</td>
<td class="org-right">100</td>
<td class="org-right">80.50</td>
<td class="org-right">100</td>
<td class="org-right">90</td>
<td class="org-right">92.625</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">92.625</td>
</tr>

<tr>
<td class="org-right">30</td>
<td class="org-left">SW38/2014</td>
<td class="org-left">Tatjana    Zdravković</td>
<td class="org-right">80</td>
<td class="org-right">23.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">75.750</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">75.75</td>
</tr>

<tr>
<td class="org-right">31</td>
<td class="org-left">SW89/2016</td>
<td class="org-left">Uroš       Jovanović</td>
<td class="org-right">100</td>
<td class="org-right">69.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">92.250</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">92.25</td>
</tr>

<tr>
<td class="org-right">32</td>
<td class="org-left">SW5/2014</td>
<td class="org-left">Stefan     Colić</td>
<td class="org-right">90</td>
<td class="org-right">69.00</td>
<td class="org-right">100</td>
<td class="org-right">90</td>
<td class="org-right">87.250</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">87.25</td>
</tr>

<tr>
<td class="org-right">33</td>
<td class="org-left">SW15/2014</td>
<td class="org-left">Ognjen     Vlajić</td>
<td class="org-right">100</td>
<td class="org-right">80.50</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">95.125</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">95.125</td>
</tr>

<tr>
<td class="org-right">34</td>
<td class="org-left">SW21/2014</td>
<td class="org-left">Tomislav   Dobrički</td>
<td class="org-right">90</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">97.500</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">97.5</td>
</tr>

<tr>
<td class="org-right">35</td>
<td class="org-left">SW53/2014</td>
<td class="org-left">Milan      Šalić</td>
<td class="org-right">100</td>
<td class="org-right">80.50</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">95.125</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">95.125</td>
</tr>

<tr>
<td class="org-right">36</td>
<td class="org-left">SW61/2015</td>
<td class="org-left">Stefan     Plazić</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">0.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0.</td>
</tr>

<tr>
<td class="org-right">37</td>
<td class="org-left">SW61/2014</td>
<td class="org-left">Mladen     Stajčić</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">0.00</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">0.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0.</td>
</tr>

<tr>
<td class="org-right">38</td>
<td class="org-left">SW62/2014</td>
<td class="org-left">Miodrag    Vilotijević</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">0.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0.</td>
</tr>

<tr>
<td class="org-right">39</td>
<td class="org-left">SW63/2014</td>
<td class="org-left">Nemanja    Žunić</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">0.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0.</td>
</tr>

<tr>
<td class="org-right">40</td>
<td class="org-left">SW8/2014</td>
<td class="org-left">Ognjen     Francuski</td>
<td class="org-right">80</td>
<td class="org-right">92.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">93.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">93.</td>
</tr>

<tr>
<td class="org-right">41</td>
<td class="org-left">SW16/2014</td>
<td class="org-left">Monika     Erdeg</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">75</td>
<td class="org-right">93.750</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">93.75</td>
</tr>

<tr>
<td class="org-right">42</td>
<td class="org-left">SW26/2014</td>
<td class="org-left">Sara       Perić</td>
<td class="org-right">100</td>
<td class="org-right">80.50</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">95.125</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">95.125</td>
</tr>

<tr>
<td class="org-right">43</td>
<td class="org-left">SW29/2014</td>
<td class="org-left">Miloš      Pavlić</td>
<td class="org-right">100</td>
<td class="org-right">92.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">98.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">98.</td>
</tr>

<tr>
<td class="org-right">44</td>
<td class="org-left">SW85/2017</td>
<td class="org-left">Aleksandar Đurić</td>
<td class="org-right">90</td>
<td class="org-right">69.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">89.750</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">89.75</td>
</tr>

<tr>
<td class="org-right">45</td>
<td class="org-left">SW86/2017</td>
<td class="org-left">Dara       Jovanović</td>
<td class="org-right">70</td>
<td class="org-right">80.50</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">87.625</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">87.625</td>
</tr>

<tr>
<td class="org-right">46</td>
<td class="org-left">SW90/2017</td>
<td class="org-left">Milica     Lazić</td>
<td class="org-right">100</td>
<td class="org-right">46.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">86.500</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">86.5</td>
</tr>

<tr>
<td class="org-right">47</td>
<td class="org-left">SW91/2017</td>
<td class="org-left">Nemanja    Đuričić</td>
<td class="org-right">80</td>
<td class="org-right">23.00</td>
<td class="org-right">66.66</td>
<td class="org-right">90</td>
<td class="org-right">64.915</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">64.915</td>
</tr>

<tr>
<td class="org-right">48</td>
<td class="org-left">SW2/2014</td>
<td class="org-left">Noemi      Sabadoš</td>
<td class="org-right">100</td>
<td class="org-right">69.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">92.250</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">92.25</td>
</tr>

<tr>
<td class="org-right">49</td>
<td class="org-left">SW20/2014</td>
<td class="org-left">Nevena     Đerić</td>
<td class="org-right">100</td>
<td class="org-right">80.50</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">95.125</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">95.125</td>
</tr>

<tr>
<td class="org-right">50</td>
<td class="org-left">SW18/2014</td>
<td class="org-left">Radoš      Aćimović</td>
<td class="org-right">100</td>
<td class="org-right">69.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">92.250</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">92.25</td>
</tr>

<tr>
<td class="org-right">51</td>
<td class="org-left">SW43/2014</td>
<td class="org-left">Nevena     Lazarević</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">100.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">100.</td>
</tr>

<tr>
<td class="org-right">52</td>
<td class="org-left">SW44/2014</td>
<td class="org-left">Sreten     Stokić</td>
<td class="org-right">100</td>
<td class="org-right">46.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">86.500</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">86.5</td>
</tr>

<tr>
<td class="org-right">53</td>
<td class="org-left">SW96/2016</td>
<td class="org-left">Filip      Jablanović</td>
<td class="org-right">80</td>
<td class="org-right">69.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">87.250</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">87.25</td>
</tr>

<tr>
<td class="org-right">54</td>
<td class="org-left">SW36/2014</td>
<td class="org-left">Natalija   Bogdanović</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">0.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0.</td>
</tr>

<tr>
<td class="org-right">55</td>
<td class="org-left">SW3/2014</td>
<td class="org-left">Andreja    Isaković</td>
<td class="org-right">90</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">97.500</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">97.5</td>
</tr>

<tr>
<td class="org-right">56</td>
<td class="org-left">SW23/2014</td>
<td class="org-left">Milica     Mlađenović</td>
<td class="org-right">80</td>
<td class="org-right">69.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">87.250</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">87.25</td>
</tr>

<tr>
<td class="org-right">57</td>
<td class="org-left">SW30/2014</td>
<td class="org-left">Filip      Savić</td>
<td class="org-right">100</td>
<td class="org-right">92.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">98.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">98.</td>
</tr>

<tr>
<td class="org-right">58</td>
<td class="org-left">SW51/2014</td>
<td class="org-left">Aleksandar Savić</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">100.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">100.</td>
</tr>

<tr>
<td class="org-right">59</td>
<td class="org-left">SW19/2014</td>
<td class="org-left">Stefan     Đurić</td>
<td class="org-right">100</td>
<td class="org-right">92.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">98.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">98.</td>
</tr>

<tr>
<td class="org-right">60</td>
<td class="org-left">SW40/2014</td>
<td class="org-left">Miroslav   Kospić</td>
<td class="org-right">50</td>
<td class="org-right">92.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">85.500</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">85.5</td>
</tr>

<tr>
<td class="org-right">61</td>
<td class="org-left">SW41/2014</td>
<td class="org-left">Momir      Kostić</td>
<td class="org-right">100</td>
<td class="org-right">69.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">92.250</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">92.25</td>
</tr>

<tr>
<td class="org-right">62</td>
<td class="org-left">SW19/2013</td>
<td class="org-left">Ivan       Mihajlov</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">0.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0.</td>
</tr>

<tr>
<td class="org-right">63</td>
<td class="org-left">SW92/2016</td>
<td class="org-left">Goran      Janković</td>
<td class="org-right">70</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">17.500</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">17.5</td>
</tr>

<tr>
<td class="org-right">64</td>
<td class="org-left">SW87/2017</td>
<td class="org-left">Đorđe      Ilić</td>
<td class="org-right">100</td>
<td class="org-right">69.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">92.250</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">92.25</td>
</tr>

<tr>
<td class="org-right">65</td>
<td class="org-left">SW88/2017</td>
<td class="org-left">Nikola     Đurđević</td>
<td class="org-right">40</td>
<td class="org-right">23.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">65.750</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">65.75</td>
</tr>

<tr>
<td class="org-right">66</td>
<td class="org-left">SW89/2017</td>
<td class="org-left">Mirjana    Lakić</td>
<td class="org-right">0</td>
<td class="org-right">46.00</td>
<td class="org-right">66.66</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">28.165</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">28.165</td>
</tr>

<tr>
<td class="org-right">67</td>
<td class="org-left">SW90/2016</td>
<td class="org-left">Stefan     Kikanović</td>
<td class="org-right">70</td>
<td class="org-right">92.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">90.500</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">90.5</td>
</tr>

<tr>
<td class="org-right">68</td>
<td class="org-left">SW91/2016</td>
<td class="org-left">Vladislav  Milivojević</td>
<td class="org-right">100</td>
<td class="org-right">57.50</td>
<td class="org-right">66.66</td>
<td class="org-right">100</td>
<td class="org-right">81.040</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">81.04</td>
</tr>

<tr>
<td class="org-right">69</td>
<td class="org-left">SW93/2016</td>
<td class="org-left">Novica     Nikolić</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">0.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0.</td>
</tr>

<tr>
<td class="org-right">70</td>
<td class="org-left">SW49/2013</td>
<td class="org-left">Ivan       Vujić</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">46.00</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">11.500</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">11.5</td>
</tr>

<tr>
<td class="org-right">71</td>
<td class="org-left">SW58/2013</td>
<td class="org-left">Branko     Karać</td>
<td class="org-right">80</td>
<td class="org-right">46.00</td>
<td class="org-right">66.66</td>
<td class="org-right">100</td>
<td class="org-right">73.165</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">73.165</td>
</tr>

<tr>
<td class="org-right">72</td>
<td class="org-left">SW97/2016</td>
<td class="org-left">Jovan      Miletić</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">0.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0.</td>
</tr>

<tr>
<td class="org-right">73</td>
<td class="org-left">SW44/2013</td>
<td class="org-left">Injac      Branko</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">0.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0.</td>
</tr>

<tr>
<td class="org-right">74</td>
<td class="org-left">SW54/2013</td>
<td class="org-left">Milović    Aleksa</td>
<td class="org-right">40</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">10.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">10.</td>
</tr>

<tr>
<td class="org-right">75</td>
<td class="org-left">SW60/2013</td>
<td class="org-left">Majkić     Miloš</td>
<td class="org-right">20</td>
<td class="org-right">23.00</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">10.750</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">10.75</td>
</tr>

<tr>
<td class="org-right">76</td>
<td class="org-left">SW64/2014</td>
<td class="org-left">Dunja      Krga</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">0.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0.</td>
</tr>

<tr>
<td class="org-right">77</td>
<td class="org-left">SW37/2013</td>
<td class="org-left">Katarina   Cerović</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">0.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0.</td>
</tr>

<tr>
<td class="org-right">78</td>
<td class="org-left">SW59/2013</td>
<td class="org-left">Nikola Dakić</td>
<td class="org-right">60</td>
<td class="org-right">69.00</td>
<td class="org-right">66.66</td>
<td class="org-right">100</td>
<td class="org-right">73.915</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">73.915</td>
</tr>

<tr>
<td class="org-right">79</td>
<td class="org-left">SL25/2014</td>
<td class="org-left">Jovica Mitrović</td>
<td class="org-right">60</td>
<td class="org-right">23.00</td>
<td class="org-right">66.66</td>
<td class="org-right">100</td>
<td class="org-right">62.415</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">62.415</td>
</tr>

<tr>
<td class="org-right">80</td>
<td class="org-left">SL8/2014</td>
<td class="org-left">Danka Vasić</td>
<td class="org-right">50</td>
<td class="org-right">46.00</td>
<td class="org-right">66.66</td>
<td class="org-right">100</td>
<td class="org-right">65.665</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">65.665</td>
</tr>

<tr>
<td class="org-right">81</td>
<td class="org-left">SL40/2014</td>
<td class="org-left">Jelena Popović</td>
<td class="org-right">100</td>
<td class="org-right">69.00</td>
<td class="org-right">86.66</td>
<td class="org-right">100</td>
<td class="org-right">88.915</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">88.915</td>
</tr>

<tr>
<td class="org-right">82</td>
<td class="org-left">SW41/2013</td>
<td class="org-left">Miljana Vinokić</td>
<td class="org-right">40</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">10.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">10.</td>
</tr>

<tr>
<td class="org-right">83</td>
<td class="org-left">???</td>
<td class="org-left">Vuk Vladisavljević</td>
<td class="org-right">80</td>
<td class="org-right">92.00</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">93.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">93.</td>
</tr>

<tr>
<td class="org-right">84</td>
<td class="org-left">SL10/2014</td>
<td class="org-left">Veljko Radić</td>
<td class="org-right">60</td>
<td class="org-right">69.00</td>
<td class="org-right">53.33</td>
<td class="org-right">100</td>
<td class="org-right">70.582</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">70.582</td>
</tr>

<tr>
<td class="org-right">85</td>
<td class="org-left">???</td>
<td class="org-left">Sandra Todorović</td>
<td class="org-right">60</td>
<td class="org-right">23.00</td>
<td class="org-right">100</td>
<td class="org-right">80</td>
<td class="org-right">65.750</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">65.75</td>
</tr>

<tr>
<td class="org-right">86</td>
<td class="org-left">SW53/2013</td>
<td class="org-left">Predrag    Falčić</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">0.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">Prosečno</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">84.507</td>
<td class="org-right">72.391</td>
<td class="org-right">95.621</td>
<td class="org-right">97.462</td>
<td class="org-right">69.002</td>
<td class="org-left">0.000</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">69.002</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">Položilo</td>
<td class="org-left">66</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">Prolaznost</td>
<td class="org-left">0.767</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
<b>Napomena</b>: Rezultati Clojure-a skalirani za <b>15%</b>. Kolona sa Clojure
rezultatima je dobijena pomoću <code>(ntp/mul-const $6 1.15)</code>
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defun</span> <span style="color: #6c3163; font-weight: bold;">ntp/mul-const</span> <span style="color: #6c3163;">(</span>column factor<span style="color: #6c3163;">)</span>
  <span style="color: #da8b55;">"Multiply COLUMN by constant FACTOR. Result is normalized to</span>
<span style="color: #da8b55;">100."</span>
  <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>not <span style="color: #67b11d;">(</span>string= <span style="color: #2d9574;">""</span> column<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
      <span style="color: #2d9574;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #67b11d;">(</span><span style="color: #b1951d;">(</span>result <span style="color: #3a81c3;">(</span>* <span style="color: #6c3163;">(</span>string-to-number column<span style="color: #6c3163;">)</span>
                       factor<span style="color: #3a81c3;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
        <span style="color: #67b11d;">(</span><span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #b1951d;">(</span>&gt; result 100<span style="color: #b1951d;">)</span>
            100
          <span style="color: #b1951d;">(</span>format <span style="color: #2d9574;">"%0.2f"</span> result<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">""</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Novak Boškov</p>
<p class="date">Created: 2018-06-18 Mon 14:13</p>
<p class="validation"></p>
</div>
</body>
</html>
